def get_schedule(weekday: int) -> str:
    schedule = {
        0: (
            "🕗 08:00 Python программалау\n"
            "   👨‍🏫 Сапакова С.З. | 🏛 303-4\n\n"
            "🕙 10:00 SQL кіріспе\n"
            "   👨‍🏫 Козина Л.А. | 🏛 700\n\n"
            "🕛 12:10 Физика\n"
            "   👨‍🏫 Ерназаров Т.И. | 🏛 300-1\n\n"
            "🌙 20:30 SQL СОӨЖ\n"
            "   🌐 Онлайн"
        ),
        1: (
            "🕗 08:00 SQL кіріспе\n"
            "   👨‍🏫 Токанова Б.М. | 🏛 706\n\n"
            "🕙 10:00 Математикалық анализ\n"
            "   👨‍🏫 Самбетова А. | 🏛 419б\n\n"
            "🕒 15:10 Дене шынықтыру\n"
            "   👨‍🏫 Бабекенов Р.Ф. | 🏛 Спортзал"
        ),
        2: (
            "🕗 08:00 Шет тілі\n"
            "   👨‍🏫 Жүнісбаева Ә.С. | 🏛 206б\n\n"
            "🕚 11:00 Python программалау\n"
            "   👨‍🏫 Чинибаева Т.Т. | 🏛 707/705\n\n"
            "🌙 20:30 Дене шынықтыру СОӨЖ\n"
            "   🌐 Онлайн"
        ),
        3: (
            "🕙 10:00 Математикалық анализ\n"
            "   👨‍🏫 Самбетова А. | 🏛 303-4\n\n"
            "🕛 12:10 Физика\n"
            "   👨‍🏫 Ерназаров Т.И. | 🏛 210\n\n"
            "🌙 20:30 Математикалық анализ СОӨЖ\n"
            "   🌐 Онлайн\n\n"
            "🌙 21:30 Физика СОӨЖ\n"
            "   🌐 Онлайн"
        ),
        4: (
            "🌙 21:30 Шет тілі СОӨЖ\n"
            "   🌐 Онлайн"
        ),
        5: (
            "🌙 20:30 Python СОӨЖ\n"
            "   🌐 Онлайн"
        ),
        6: "🌴 Выходной день! Отдыхай! 😊",
    }
    return schedule.get(weekday, "✅ Пар нет!")

TEACHERS = [
    "👨‍🏫 Сапакова С.З. — Python программалау",
    "👨‍🏫 Козина Л.А. — SQL кіріспе",
    "👨‍🏫 Токанова Б.М. — SQL кіріспе",
    "👨‍🏫 Ерназаров Т.И. — Физика",
    "👨‍🏫 Самбетова А. — Математикалық анализ",
    "👨‍🏫 Жүнісбаева Ә.С. — Шет тілі",
    "👨‍🏫 Чинибаева Т.Т. — Python программалау",
    "👨‍🏫 Бабекенов Р.Ф. — Дене шынықтыру",
]

SUBJECTS = [
    "📚 Python тілінде программалау",
    "📚 SQL-ге кіріспе",
    "📚 Физика",
    "📚 Математикалық анализ",
    "📚 Шет тілі",
    "📚 Дене шынықтыру",
]